research/networking.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2019-11-12 Tue 12:55 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Networking</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Henry Robinson" />
<link rel="stylesheet" type="text/css" href="https://gongzhitaao.org/orgcss/org.css"/>
</head>
<body>
<div id="content">
<h1 class="title">Networking</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgf7183e1">1. TCP/IP</a></li>
</ul>
</div>
</div>
<div id="outline-container-orgf7183e1" class="outline-2">
<h2 id="orgf7183e1"><span class="section-number-2">1</span> TCP/IP</h2>
<div class="outline-text-2" id="text-1">
<ul class="org-ul">
<li><b>Bandwidth delay product</b>
<ul class="org-ul">
<li>The BDP is the product of a link's throughput in bytes/second, and its RTT latency, in
seconds. So the unit is seconds.</li>
<li>The idea is that the BDP is the maximum amount of data you can push onto a link before
you can expect to get an acknowledgement.</li>
<li>A BDP &gt; 12500 bytes is called a Long Fat Network (LFN).</li>
<li>If the TCP window is smaller than the BDP, the link is under-utilized.</li>
</ul></li>
<li><b>Congestion control</b> and <b>Window sizes</b>
<ul class="org-ul">
<li>Congestion control ensures that everyone gets a fair share of the link (or at least
that the sender responds appropriately to contention for bandwidth)</li>
<li>Senders and receivers negotiate the size of the amount of un-acked data that can be
sent at any time.</li>
<li>The <b>rwnd</b> is the maximum amount of data that the receiver can buffer.</li>
<li>The <b>cwnd</b> is the amount of data that the sender estimates the link can buffer at any
time. It cannot exceed rwnd.</li>
<li>There are many variant algorithms for how to adjust cwnd. They take ACKs, duplicate
ACKs and timeout events as input.</li>
<li>TCP <b>slow start</b> is the algorithm used during initial link use until a packet loss
event is detected. The cwnd starts off at some small multiple of the MSS. It is
increased with every ACK received.</li>
</ul></li>
<li><b>Flow control</b>
<ul class="org-ul">
<li>Flow control avoids sending at a rate faster than the receiver can handle.</li>
<li>TCP uses a <b>sliding window</b> flow control algorithm.</li>
<li>The receiver uses the rwnd to advertise how much data it is willing to continue to
buffer.</li>
<li>The sender keeps track of the rwnd-wide window of packets it can send, where the start
is the packet with the lowest un-ACKed sequence number.</li>
<li>The window size can be scaled via a negotiated 'window scale' parameter.</li>
</ul></li>
<li><b>Nagle's algorithm</b>
<ul class="org-ul">
<li>What to do about an application that sends very small packets?</li>
<li>TCP headers are 40 bytes for IPv4, so overhead can be 100% or more.</li>
<li>Nagle's algorithm basically says to buffer packets on the sender side until an ACK has
been received.</li>
<li>If there is un-ACKed data, buffer, if there is not, send now (because the receiver
might be waiting for your critical packet!)</li>
<li>However, for large writes (more than one packet) this can be a problem, because the
receiver may wait before sending an ACK (ACKs are cumulative, and indicate that all
packets before the ACK's sequence number have been received).</li>
<li>And for interactive applications, this isn't great because you care about latency,
which Nagle penalises (and packet sizes can be small!).</li>
<li>So often disable Nagling with TCP<sub>NODELAY</sub> socket option.</li>
</ul></li>
<li><b>ACKs</b>
<ul class="org-ul">
<li>ACKs are cumulative - a sequence number of N means that all packets 0..N have been
received.</li>
<li>If a gap in a sequence has been detected, the receiver will retransmit an ACK with the
highest previously acknowledged sequence number.</li>
<li>If the receiver receives 3+ ACKs for a sequence number, it will retransmit all packets
from N + 1 on.</li>
</ul></li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Henry Robinson</p>
<p class="date">Created: 2019-11-12 Tue 12:55</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
